---
kind: method
id: M:Autodesk.Revit.DB.KeyBasedTreeEntryError.Dispose
source: html/d3ba428b-14c6-f76b-7994-b418d2fcd409.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntryError.Dispose Method

Releases all resources used by the KeyBasedTreeEntryError

## Syntax (C#)
```csharp
public void Dispose()
```